predict slary based on the years of experience

In [5]:
import pandas as pd

In [43]:
salary_path = r'C:\Users\HP\ML PARCTICE\Salary.csv'
salary_data = pd.read_csv(salary_path)
salary_data

    YearsExperience  Salary
0               1.1   39343
1               1.3   46205
2               1.5   37731
3               2.0   43525
4               2.2   39891
5               2.9   56642
6               3.0   60150
7               3.2   54445
8               3.2   64445
9               3.7   57189
10              3.9   63218
11              4.0   55794
12              4.0   56957
13              4.1   57081
14              4.5   61111
15              4.9   67938
16              5.1   66029
17              5.3   83088
18              5.9   81363
19              6.0   93940
20              6.8   91738
21              7.1   98273
22              7.9  101302
23              8.2  113812
24              8.7  109431
25              9.0  105582
26              9.5  116969
27              9.6  112635
28             10.3  122391
29             10.5  121872
30             11.2  127345
31             11.5  126756
32             12.3  128765
33             12.9  135675
34             13.5  139465

In [9]:
salary_data.describe()

       YearsExperience         Salary
count        35.000000      35.000000
mean          6.308571   83945.600000
std           3.618610   32162.673003
min           1.100000   37731.000000
25%           3.450000   57019.000000
50%           5.300000   81363.000000
75%           9.250000  113223.500000
max          13.500000  139465.000000

In [10]:
salary_data.head()

   YearsExperience  Salary
0              1.1   39343
1              1.3   46205
2              1.5   37731
3              2.0   43525
4              2.2   39891

In [12]:
salary_data.columns

Index(['YearsExperience', 'Salary'], dtype='object')

In [27]:
y = salary_data.Salary

In [15]:
from sklearn.tree import DecisionTreeRegressor

In [23]:
X = salary_data ['YearsExperience']

In [24]:
X.describe()

count    35.000000
mean      6.308571
std       3.618610
min       1.100000
25%       3.450000
50%       5.300000
75%       9.250000
max      13.500000
Name: YearsExperience, dtype: float64

In [25]:
X.head()

0    1.1
1    1.3
2    1.5
3    2.0
4    2.2
Name: YearsExperience, dtype: float64

In [31]:
X_reshaped = X.to_numpy().reshape(-1, 1)

In [33]:
salary_model= DecisionTreeRegressor(random_state = 1)
salary_model.fit (X_reshaped,y)

DecisionTreeRegressor(random_state=1)

In [37]:
predictions = salary_model.predict(X_reshaped)
print(predictions)

[ 39343.   46205.   37731.   43525.   39891.   56642.   60150.   59445.
  59445.   57189.   63218.   56375.5  56375.5  57081.   61111.   67938.
  66029.   83088.   81363.   93940.   91738.   98273.  101302.  113812.
 109431.  105582.  116969.  112635.  122391.  121872.  127345.  126756.
 128765.  135675.  139465. ]

In [39]:
#from sklearn.model_selection import train_test_split

In [42]:
#train_X, val_X, train_y,val_y = train_test_split (random_state =1)